# DoubleClickOptions Properties

---
The DoubleClickOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DoubleClickOptions Class
Autodesk.Revit.UI Namespace